extends Control


var dialogue = [
	{"text": "Тёмыч: ДА ОТКУДА ВЫ ВСЕ ВЗЯЛИСЬ?!!", "anim": ["Temich", "en_garde"]},
	{"text": "Титанаванна: [shake][color=#ff990000]Сдавайся, ты уже никуда от нас не сбежишь!"},
	{"text": "Светланфёдрна: [shake][color=#ff990000]Напоминает историю про желе"},
	{"text": "Анжелнатольна: [shake][color=#ff990000]Ша-нов-ний! Ну досить вже грати на публіку. Усім вже усе зрозуміло."},
	{"text": "Анжелнатольна: [shake][color=#ff990000]То як ти зібрався один проти усіх боротися? Вчив би українську літературу, знав би, що сталось із Тарасом Шевченком."},
	{"text": "Наталья Юрьевна: [shake][color=#ff990000]My friend, this whole ordeal brought me back from Kyiv. Such a spectacular action, and I wish it didn't end so tragic..."},
	{"text": "Тёмыч: ...Я сдаюсь. Вы победили, я вас поздравляю.", "anim": ["Temich", "default"]},
	{"text": "Тёмыч: К тому же, как мне кажется, лучше заставить людей бороться за новый год. Так намного веселее.", "anim": ["Temich", "kek"]},
	{"text": "Титанаванна: Отправляйся домой, а завтра разрушишь все ёлки в школе."},
	{"text": "Титанаванна: Долой новый год!"},
	{"text": "Все: Долой новый год!"},
	{"out": "res://scenes/levels/cutscene_laststory_1.tscn"},
]
