extends Control


var dialogue = [
	{"text": "Ольгнасильна: А, Зинец, мой преданный слуга. Рада видеть тебя."},
	{"text": "Ольгнасильна: Последняя ёлка осталась в 320-м кабинете. Надеюсь, ты справишься с ней."},
	{"text": "Тёмыч: Ваше Высочество, планы изменились"},
	{"text": "Тёмыч: Пришла подмога из ЗИЭИТа. Вы будете уничтожены."},
	{"text": "Ольгнасильна: ЗИЭИТ? Теперь ясно, куда я брошу свою следующую термоядерную гранату."},
	{"text": "Очень жаль, что там, где было славное учебное заведение, останется нора."},
	{"text": "Тёмыч: Хватит пустых разговоров! Защищайтесь и приготовьтесь пасть смертью храбрых!"},
	{"out": "res://scenes/levels/level_finalboss_stage1.tscn"},
]
