extends Control


var dialogue = [
	{"text": "[color=#ff009900]16 декабря: Закулисье"},
	{"text": "Егорыч: [shake]ЭТИ ЧЕРТИ ЛЕЗУТ ИЗО ВСЕХ ЩЕЛЕЙ!"},
	{"text": "Егорыч: [shake]ОНИ ДАЖЕ НЕ ДВИГАЮТ НОГАМИ, ОНИ ПЕРЕМЕЩАЮТ ПРОСТРАНСТВО И ВРЕМЯ ВОКРУГ СЕБЯ ВСЕГО ЛИШЬ СИЛОЙ НАГЛОСТИ И ПОДЛОСТИ!"},
	{"text": "Егорыч: [shake]ГДЕ ПОДКРЕПЛЕНИЕ?! ПЕРВЫЙ, ПЕРВЫЙ, Я ВТОРОЙ, КОД ЧЕТЫРЕ, ЗАПРАШИВАЮ ЭВАКУАЦИЮ!!!!!11"},
	{"text": "Лентольна: [color=#ff009900]Алё, Егор, Ксюша докладывает о приближении Артёма. Срочно беги в 320-й!"},
	{"text": "Егорыч: УЖЕ ИДУ!", "anim": ["Egorich", "yee"]},
	{"out": "res://scenes/levels/cutscene_egorichfinalboss.tscn"},
]
