extends Control


var dialogue = [
	{"text": "[color=#ff009900]16 декабря: 320-й."},
	{"text": "Тёмыч: Вот как-то так обстоят дела.", "music": "res://sounds/temich_theme.ogg", "anim": ["Temich", "rage"]},
	{"text": "Егорыч: Ну и ну. Так а почему ты меня с собой не взял?! Я бы тебя выручил!", "anim": ["Egorich", "hmm"]},
	{"text": "Тёмыч: Егорыч, ты был в ЗИЭИТе. Сдавал свои эти, как их там, экзамены что ли", "anim": ["Temich", "rage"]},
	{"text": "Тёмыч: Как бы ты пришел? И как ты, кстати, появился?"},
	{"text": "Егорыч: Так я когда узнал что ты тут устроил, сразу все сдал заранее, географичке занес кубинского кофе", "anim": ["Egorich", "rage"]},
	{"text": "Егорыч: И сразу пришел."},
	{"text": "Тёмыч: Кек. Ну ладно, раз уж ты тут, пора наконец-то уничтожить Ольгнасильну!", "anim": ["Temich", "kek"]},
	{"text": "Тёмыч: За всем стоит именно она. Если мы сможем силой ее переубедить, то мы сможем отменить ее диктаторский указ!", "anim": ["Temich", "en_garde"]},
	{"text": "Егорыч: Так и сделаем, Тьоха. Она в актовом зале, я ее там видел краем глаза."},
	{"out": "res://scenes/levels/cutscene_encounter_olgnasilna.tscn"},
]
